app/controllers/companies_controller.rb

SELECT "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT $2  [["id", "ec6b3899-25e1-4a10-956b-db99fcac8b7b"], ["LIMIT", 1]]
---
  def show
    id = params[:id]
    @company = Company.find(id)

INSERT INTO "companies" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Orange "], ["email", "orange@gmail.com"], ["created_at", "2021-11-08 09:00:11.822626"], ["updated_at", "2021-11-08 09:00:11.822626"]]
---
  def create
    @company = Company.new(company_params)
    if (@company.save)

SELECT "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT $2  [["id", "ec6b3899-25e1-4a10-956b-db99fcac8b7b"], ["LIMIT", 1]]
---
  def edit
    @company = Company.find(params[:id])

SELECT "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT $2  [["id", "ec6b3899-25e1-4a10-956b-db99fcac8b7b"], ["LIMIT", 1]]
UPDATE "companies" SET "name" = $1, "updated_at" = $2 WHERE "companies"."id" = $3  [["name", "Aroli Group CI"], ["updated_at", "2021-11-03 16:50:17.521621"], ["id", "ec6b3899-25e1-4a10-956b-db99fcac8b7b"]]
---
  def update
    @company = Company.find(params[:id])

    if @company.update(company_params)

SELECT "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT $2  [["id", "ce3088fa-3516-4e1b-a46a-59968edb8ce2"], ["LIMIT", 1]]
DELETE FROM "companies" WHERE "companies"."id" = $1  [["id", "ce3088fa-3516-4e1b-a46a-59968edb8ce2"]]
---
  def destroy
    id = params[:id]
    company = Company.find(id)
    company.destroy